tweetclone/app/Models/TweetModel.php

    public function newTweet($curUser, $post)
    {
        $tweet = new \App\Entities\Tweet();
        $tweet->user_id = $curUser['userid'];
        $tweet->content = $post['content'];
        $tweet->category = $post['category'];
        $this->save($tweet);
---
INSERT INTO `tweets` (`user_id`, `content`, `category`) VALUES ('11', 'abcde', 'pemrograman')

    public function getByCategory($category)
    {
        $query = $this->select('tweets.id, user_id, username, fullname, content, category, created_at')
            ->where('category', $category)->orderBy('created_at', 'desc')
            ->join('users', 'users.id = tweets.user_id');;
        return $query->findAll();
---
SELECT `tweets`.`id`, `user_id`, `username`, `fullname`, `content`, `category`, `created_at`
FROM `tweets`
JOIN `users` ON `users`.`id` = `tweets`.`user_id`
WHERE `category` = 'pemrograman'
ORDER BY `created_at` DESC

    public function editTweet($post)
    {
        $tweet = $this->find($post['id']);
        if ($tweet) {
            $tweet->content = $post['content'];
            $tweet->category = $post['category'];
            $this->save($tweet);
---
SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '102'
UPDATE `tweets` SET `content` = 'abcdefgh', `category` = 'pendidikan'
WHERE `tweets`.`id` IN ('102')

    public function delTweet($user_id, $tweet_id)
    {
        $tweet = $this->find($tweet_id);
        if ($tweet) {
            if ($user_id == $tweet->user_id) {
                $this->delete($tweet->id, true);
---
SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '102'
DELETE FROM `tweets`
WHERE `id` IN ('102')